УТ_для_edt/src/Documents/смартПланПродажПоМенеджерам/смартПланПродажПоМенеджерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартПланПродажПоМенеджерам</name>
  <comment>//++ #1498 смарт: Фролов 17.10.2023 //Разработать план продаж</comment>
  <registerRecords>AccumulationRegister.смартПланПродажПоМенеджерам</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДляРасчетаРублевогоПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентИзмененияОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыПланаПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПланНаСледПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПлана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>EnumRef.смартВидПлана</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планирование</name>
    <attributes>
      <name>СегментНоменклатуры</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
      <type>
        <types>DefinedType.Подразделение</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентИзменения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеИзменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПланКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыТоваровМенеджеров</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаТоваров</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПартнерыИсключения</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартПланПродажПоМенеджерам/смартПланПродажПоМенеджерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартПланПродажПоМенеджерам</name>
  <comment>//++ #1498 смарт: Фролов 17.10.2023 //Разработать план продаж</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоэффициентИзменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипУслуги</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПлана</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>EnumRef.смартВидПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СегментНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартСтатусыПланаПродаж/смартСтатусыПланаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыПланаПродаж</name>
  <comment>//++ #1498 смарт: Фролов 17.10.2023 //Разработать план продаж</comment>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартКорректировкаПланаПродаж/смартКорректировкаПланаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартКорректировкаПланаПродаж</name>
  <comment>//++ #1498 смарт: Фролов 23.10.2023 //Разработать план продаж</comment>
  <basedOn>Document.смартПланПродажПоМенеджерам</basedOn>
  <registerRecords>AccumulationRegister.смартПланПродажПоМенеджерам</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДляРасчетаРублевогоПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентИзмененияОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыПланаПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.смартПланПродажПоМенеджерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>EnumRef.смартВидПлана</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планирование</name>
    <attributes>
      <name>СегментНоменклатуры</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
      <type>
        <types>DefinedType.Подразделение</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентИзменения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПланКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеИзменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйПланКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартПланПродажПоМенеджерам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Проведен и РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения ТОгда
		Запрос=Новый Запрос("ВЫБРАТЬ
						|	смартКорректировкаПланаПродаж.Ссылка КАК Ссылка
						|ИЗ
						|	Документ.смартКорректировкаПланаПродаж КАК смартКорректировкаПланаПродаж
						|ГДЕ
						|	смартКорректировкаПланаПродаж.ДокументОснование = &Ссылка
						|	И смартКорректировкаПланаПродаж.Проведен");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() ТОгда
			ОбщегоНазначения.СообщитьПользователю("На основании документа создана корректировка, отмена проведения недопустима!");	
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.смартПланПродажПоМенеджерам.Записывать = Истина;
	Если Статус=перечисления.смартСтатусыПланаПродаж.Утвержден Тогда
		Для Каждого ТекСтрокаПланирование Из Планирование Цикл
			
			Движение = Движения.смартПланПродажПоМенеджерам.Добавить();
			Движение.Период = ТекСтрокаПланирование.Период;
			Движение.ВидПлана = ВидПлана;
			Движение.ТипУслуги = ТипУслуги;
			Движение.Менеджер = ТекСтрокаПланирование.Менеджер;
			Движение.Подразделение = ТекСтрокаПланирование.Подразделение;
			Движение.СегментНоменклатуры = ТекСтрокаПланирование.СегментНоменклатуры;
			Движение.Количество = ТекСтрокаПланирование.НовыйПланКоличество;
			Движение.Цена = ТекСтрокаПланирование.Цена;
			Движение.Сумма = ТекСтрокаПланирование.НовыйПлан;
			Движение.СуммаРегл = ТекСтрокаПланирование.НовыйПлан*КурсДляРасчетаРублевогоПлана;
			Движение.КоэффициентИзменения = ТекСтрокаПланирование.КоэффициентИзменения;
			Движение.Комментарий = ТекСтрокаПланирование.Комментарий;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
